
## Plan Result




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.role-assignment-database-v11.azurerm_resource_group.data-resourcegroup
  * module.role-assignment-database-v11.azurerm_template_deployment.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.role-assignment-database-v11.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "am-role-assignment-service-postgres-db-v11-aat"
      + resource_group_name = "am-role-assignment-service-postgres-db-v11-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)
    }

  # module.role-assignment-database-v11.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-role-assignment-service-postgres-db-v11-data-aat"
        name     = "am-role-assignment-service-postgres-db-v11-data-aat"
      ~ tags     = {
            "application"         = "access-management"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/am-role-assignment-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#am-master-builds"
            "environment"         = "staging"
            "managedBy"           = "AM"
        }
        # (1 unchanged attribute hidden)
    }

  # module.role-assignment-database-v11.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-role-assignment-service-postgres-db-v11-data-aat/providers/Microsoft.Resources/deployments/am-role-assignment-service-postgres-db-v11-aat"
        name                = "am-role-assignment-service-postgres-db-v11-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImFjY2Vzcy1tYW5hZ2VtZW50IiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL2FtLXJvbGUtYXNzaWdubWVudC1zZXJ2aWNlLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjYW0tbWFzdGVyLWJ1aWxkcyIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6IkFNIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImFjY2Vzcy1tYW5hZ2VtZW50IiwiYXV0b1NodXRkb3duIjoidHJ1ZSIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9hbS1yb2xlLWFzc2lnbm1lbnQtc2VydmljZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2FtLW1hc3Rlci1idWlsZHMiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJBTSJ9"
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1981,"Program":"tfcmt","SHA1":"","Vars":{}} -->